FemDesign.Sections.SectionDatabase
Section database.

FemDesign.Sections.SectionDatabase.#ctor
Parameterless constructor for serialization

FemDesign.Sections.SectionDatabase.SectionByName(System.String)
Get a Section from a SectionDatabase by name.
Remarks: Action
sectionName: Name of Section.
Returns:

FemDesign.Sections.SectionDatabase.SectionNames
List the names of all Sections in SectionDatabase.
Remarks: Action
Returns:

FemDesign.Sections.SectionDatabase.AddNewSection(FemDesign.Sections.Section)
Add a section to this section database

FemDesign.Sections.SectionDatabase.SectionInDatabase(FemDesign.Sections.Section)
Check if a section is in this section database

FemDesign.Sections.SectionDatabase.DeserializeStruxml(System.String)
Load a custom SectionDatabase from a .struxml file.
Remarks: Create
filePath: File path to .struxml file.
Returns:

FemDesign.Sections.SectionDatabase.DeserializeFromResource
Deserialize section database from embedded resource.

FemDesign.Sections.SectionDatabase.GetDefault
Load the default SectionDatabase.
Remarks: Create
Returns:

FemDesign.Sections.SectionDatabase.SerializeSectionDatabase(System.String)
Serialize section database to file